export const sections = ["المعلومات الأساسية", "تقييم الجدارات الأساسية", "تقييم الجدارات الفنية", "نتيجة الاختبار الذاتي"];

export const adminSections = ["المعلومات الأساسية", "تقييم الجدارات الأساسية", "تقييم الجدارات الفنية", "تقييم الجدارات القيادية", "نتيجة الاختبار الذاتي"]

export const resultsSections = ["نتيجة التقييم الذاتي", "نتيجة تقييم المدير", "نتيجة التقييم النهائي", "نصائح وأفكار هامة"]

export const questions = [
    [
        {
            question: "كيف يشجع مدير المواهب تبادل الأفكار والتعاون بين أعضاء الفريق؟ (اختر إجابة واحدة)",
            answers: [
                "أ. ينظم جلسات تفكير جماعي ويشجع الموظفين على المشاركة بشكل فعال والاستماع لبعضهم البعض",
                "ب. يستمع لأفكار الموظفين في اجتماعات فردية ويشجعهم على مشاركتها مع زملائهم",
                "ج. يستقبل الأفكار من الموظفين عبر البريد الإلكتروني ويقوم بتوزيعها على الفريق",
                "د. يتوقع من الموظفين تقديم الأفكار بشكل فردي دون تشجيع التفاعل والتعاون"
            ]
        },
        {
            question: "في موقف حيث يتعين على مدير المواهب حل مشكلة معينة تتعلق بالعمل بالتعاون مع فريقه، كيف يتعامل المدير مع الموقف؟ (اختر إجابة واحدة)",
            answers: [
                "أ. يشارك الفريق في تحديد المشكلة ويشجعهم على تقديم آرائهم ويعمل معهم بناءً على تلك الآراء لوضع خطة مشتركة لحل المشكلة",
                "ب. يحدد المشكلة ويستمع لآراء الفريق ولكن يتخذ قراره النهائي بناءً على معرفته وخبرته الشخصية",
                "ج. يحدد المشكلة بنفسه ويقدم حلوله الخاصة دون استشارة الفريق أو الاستماع لآرائهم"
            ]
        }
    ],
    [
        {
            question: "كيف يشجع مدير المواهب تبادل الأفكار والتعاون بين أعضاء الفريق؟ (اختر إجابة واحدة)",
            answers: [
                "أ. ينظم جلسات تفكير جماعي ويشجع الموظفين على المشاركة بشكل فعال والاستماع لبعضهم البعض",
                "ب. يستمع لأفكار الموظفين في اجتماعات فردية ويشجعهم على مشاركتها مع زملائهم",
                "ج. يستقبل الأفكار من الموظفين عبر البريد الإلكتروني ويقوم بتوزيعها على الفريق",
                "د. يتوقع من الموظفين تقديم الأفكار بشكل فردي دون تشجيع التفاعل والتعاون"
            ]
        },
        {
            question: "في موقف حيث يتعين على مدير المواهب حل مشكلة معينة تتعلق بالعمل بالتعاون مع فريقه، كيف يتعامل المدير مع الموقف؟ (اختر إجابة واحدة)",
            answers: [
                "أ. يشارك الفريق في تحديد المشكلة ويشجعهم على تقديم آرائهم ويعمل معهم بناءً على تلك الآراء لوضع خطة مشتركة لحل المشكلة",
                "ب. يحدد المشكلة ويستمع لآراء الفريق ولكن يتخذ قراره النهائي بناءً على معرفته وخبرته الشخصية",
                "ج. يحدد المشكلة بنفسه ويقدم حلوله الخاصة دون استشارة الفريق أو الاستماع لآرائهم"
            ]
        },
        {
            question: "في موقف حيث يتعين على مدير المواهب حل مشكلة معينة تتعلق بالعمل بالتعاون مع فريقه، كيف يتعامل المدير مع الموقف؟ (اختر إجابة واحدة)",
            answers: [
                "أ. يشارك الفريق في تحديد المشكلة ويشجعهم على تقديم آرائهم ويعمل معهم بناءً على تلك الآراء لوضع خطة مشتركة لحل المشكلة",
                "ب. يحدد المشكلة ويستمع لآراء الفريق ولكن يتخذ قراره النهائي بناءً على معرفته وخبرته الشخصية",
                "ج. يحدد المشكلة بنفسه ويقدم حلوله الخاصة دون استشارة الفريق أو الاستماع لآرائهم"
            ]
        }
    ],
    [
        {
            question: "كيف يشجع مدير المواهب تبادل الأفكار والتعاون بين أعضاء الفريق؟ (اختر إجابة واحدة)",
            answers: [
                "أ. ينظم جلسات تفكير جماعي ويشجع الموظفين على المشاركة بشكل فعال والاستماع لبعضهم البعض",
                "ب. يستمع لأفكار الموظفين في اجتماعات فردية ويشجعهم على مشاركتها مع زملائهم",
                "ج. يستقبل الأفكار من الموظفين عبر البريد الإلكتروني ويقوم بتوزيعها على الفريق",
                "د. يتوقع من الموظفين تقديم الأفكار بشكل فردي دون تشجيع التفاعل والتعاون"
            ]
        },
        {
            question: "في موقف حيث يتعين على مدير المواهب حل مشكلة معينة تتعلق بالعمل بالتعاون مع فريقه، كيف يتعامل المدير مع الموقف؟ (اختر إجابة واحدة)",
            answers: [
                "أ. يشارك الفريق في تحديد المشكلة ويشجعهم على تقديم آرائهم ويعمل معهم بناءً على تلك الآراء لوضع خطة مشتركة لحل المشكلة",
                "ب. يحدد المشكلة ويستمع لآراء الفريق ولكن يتخذ قراره النهائي بناءً على معرفته وخبرته الشخصية",
                "ج. يحدد المشكلة بنفسه ويقدم حلوله الخاصة دون استشارة الفريق أو الاستماع لآرائهم"
            ]
        }
    ],
]

export const employeesData = [
    {
        id: "01", num: 101921, name: "عبدالرحمن محمد الدخيل الله", selfAssess: {completed: true, text: "مكتملة (متاحة للاطلاع)"},
        managerAssess: {completed: true, text: "اكتمل تقييمك"}, bottomLine: {completed: true, text: "مكتملة (متاحة للاطلاع)"}, finalAssess: {completed: true, text: "مكتملة (متاحة للاطلاع)"}
    },
    {
        id: "02", num: 101924, name: "عبدالعزيز خضر المطرفي اللافي", selfAssess: {completed: true, text: "مكتملة (متاحة للاطلاع)"},
        managerAssess: {completed: true, text: "اكتمل تقييمك"}, bottomLine: {completed: true, text: "مكتملة (متاحة للاطلاع)"}, finalAssess: {completed: false, text: "تحت الإعداد"}
    },
    {
        id: "04", num: 101932, name: "سارة بندر أحمد الحسن", selfAssess: {completed: true, text: "مكتملة - انقر هنا"},
        managerAssess: {completed: false, text: "يمكنك التقييم الآن", red: true}, bottomLine: {completed: false, text: "بالإنتظار"}, finalAssess: {completed: false, text: "بالإنتظار"}
    },
    {
        id: "05", num: 101934, name: "عبدالله فهد محمد المحسن", selfAssess: {completed: false, text: "لم تكتمل بعد"},
        managerAssess: {completed: false, text: "بالإنتظار"}, bottomLine: {completed: false, text: "بالإنتظار"}, finalAssess: {completed: false, text: "بالإنتظار"}
    },
]

// results page data
export const behavioralCompetenciesResults = [
    {title: "الإلتزام بتعاليم المؤسسة وتنفيذالمطلوب بشكل صحيح", percent: 20, points: "15 من 40 نقطة", desc:"هذه الجدارة ضعيفة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#7239ea"},
    {title: "التعاون والمشاركة", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة متوسطة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#6ad49b"},
    {title: "التواصل مع الآخرين", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة ممتازة ولا تحتاج دورات تدريبية أو دعم", color:"#f35d82"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#22a8f5"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#fcd201"},
    {title: "استيعاب المطلوب والتجاوب", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة متوسطة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#6ad4d4"},
]
export const technicalCompetenciesResults = [
    {title: "إدارة رأس المال البشري", percent: 20, points: "15 من 40 نقطة", desc:"هذه الجدارة ضعيفة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#7239ea"},
    {title: "تنظيم المواهب والكفاءات", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة متوسطة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#6ad49b"},
    {title: "التواصل مع الآخرين", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة ممتازة ولا تحتاج دورات تدريبية أو دعم", color:"#f35d82"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#22a8f5"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#fcd201"},
]
export const leadershipCompetenciesResults = [
    {title: "إدارة رأس المال البشري", percent: 20, points: "15 من 40 نقطة", desc:"هذه الجدارة ضعيفة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#7239ea"},
    {title: "تنظيم المواهب والكفاءات", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة متوسطة وقد تحتاج إلى دورات تدريبية أو دعم", color:"#6ad49b"},
    {title: "التواصل مع الآخرين", percent: 30, points: "15 من 40 نقطة", desc:"هذه الجدارة ممتازة ولا تحتاج دورات تدريبية أو دعم", color:"#f35d82"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#22a8f5"},
    {title: "القدرة على الإنجاز", percent: 75, points: "150 من 200 نقطة", desc:"هذه الجدارة جيدة جداًولا نحتاج دورات تدريبية أو دعم", color:"#fcd201"},
]